In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib_inline.backend_inline
matplotlib_inline.backend_inline.set_matplotlib_formats('svg')

In [3]:
df = pd.read_csv('../../../Datasets/Apartement Rent Data/apartments_for_rent_classified_100K/apartments_for_rent_classified_100K.csv',
                 sep=';',
                 encoding='cp1252',
                low_memory=False)

In [12]:
na_mean = df.isna().mean()
cca_cols = na_mean[(na_mean < 0.05) & (na_mean > 0)].index

In [13]:
cca_cols

Index(['bathrooms', 'bedrooms', 'price', 'price_display', 'cityname', 'state',
       'latitude', 'longitude'],
      dtype='object')

In [16]:
df[cca_cols]

,bathrooms,bedrooms,price,price_display,cityname,state,latitude,longitude
0,1.0,1.0,2195.0,"$2,195",Redondo Beach,CA,33.8520,-118.3759
1,1.5,3.0,1250.0,"$1,250",Newport News,VA,37.0867,-76.4941
2,2.0,3.0,1395.0,"$1,395",Raleigh,NC,35.8230,-78.6438
3,1.0,2.0,1600.0,"$1,600",Vacaville,CA,38.3622,-121.9712
4,1.0,1.0,975.0,$975,Albuquerque,NM,35.1038,-106.6110
...,...,...,...,...,...,...,...,...
99487,1.0,1.0,780.0,$780,Houston,TX,29.6151,-95.1998
99488,2.0,2.0,813.0,$813,Jacksonville,FL,30.2254,-81.7579
99489,1.0,1.0,1325.0,"$1,325",San Diego,CA,32.7379,-117.0914
99490,1.0,1.0,931.0,$931,Huntersville,NC,35.4158,-80.8451
99491,1.5,2.0,1595.0,"$1,595",San Diego,CA,32.7379,-117.0914

## Cara 1

In [21]:
df_t = df.dropna(subset=cca_cols)

In [22]:
df.shape[0]-df_t.shape[0]

485

## Cara 2
Drop ketika NA di semua column

In [23]:
df_t = df.dropna(how='all')

In [24]:
df.shape[0]-df_t.shape[0]

0